[0m[1maws_vpc.vpc: Refreshing state... [id=vpc-0eb1fe89dc0576ef9][0m
[0m[1maws_subnet.db[1]: Refreshing state... [id=subnet-05ee11be15a53ff17][0m
[0m[1maws_subnet.private: Refreshing state... [id=subnet-03acb4036889acd9d][0m
[0m[1maws_internet_gateway.igw: Refreshing state... [id=igw-02c1191b6fb0ec61f][0m
[0m[1maws_subnet.public: Refreshing state... [id=subnet-0834e3471167e619c][0m
[0m[1maws_subnet.db[0]: Refreshing state... [id=subnet-0c1ee98f5bbcfcaa9][0m
[0m[1maws_security_group.web_sg: Refreshing state... [id=sg-0ab4a43e9d264572f][0m
[0m[1maws_db_subnet_group.rds_subnet_group: Refreshing state... [id=rds-subnet-group][0m
[0m[1maws_security_group.db_sg: Refreshing state... [id=sg-04c5a2138480b2548][0m
[0m[1maws_route_table.public_rt: Refreshing state... [id=rtb-0be617f7d29c898fa][0m
[0m[1maws_route_table_association.public_rt_association: Refreshing state... [id=rtbassoc-0d77ddfa5ef11be5f][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_db_instance.rds[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_db_instance" "rds" {
      [32m+[0m [0m[1m[0maddress[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mallocated_storage[0m[0m                     = 10
      [32m+[0m [0m[1m[0mapply_immediately[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                                   = (known after apply)
      [32m+[0m [0m[1m[0mauto_minor_version_upgrade[0m[0m            = true
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mbackup_retention_period[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mbackup_window[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mca_cert_identifier[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcharacter_set_name[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcopy_tags_to_snapshot[0m[0m                 = false
      [32m+[0m [0m[1m[0mdb_name[0m[0m                               = "wp_db"
      [32m+[0m [0m[1m[0mdb_subnet_group_name[0m[0m                  = "rds-subnet-group"
      [32m+[0m [0m[1m[0mdelete_automated_backups[0m[0m              = true
      [32m+[0m [0m[1m[0mendpoint[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mengine[0m[0m                                = "mysql"
      [32m+[0m [0m[1m[0mengine_version[0m[0m                        = "5.7"
      [32m+[0m [0m[1m[0mengine_version_actual[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                    = (known after apply)
      [32m+[0m [0m[1m[0midentifier[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0midentifier_prefix[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0minstance_class[0m[0m                        = "db.t2.micro"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mlatest_restorable_time[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mlicense_model[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mmaintenance_window[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring_interval[0m[0m                   = 0
      [32m+[0m [0m[1m[0mmonitoring_role_arn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmulti_az[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0mnchar_character_set_name[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0moption_group_name[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mparameter_group_name[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mpassword[0m[0m                              = (sensitive value)
      [32m+[0m [0m[1m[0mperformance_insights_enabled[0m[0m          = false
      [32m+[0m [0m[1m[0mperformance_insights_kms_key_id[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mperformance_insights_retention_period[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mport[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0mpublicly_accessible[0m[0m                   = false
      [32m+[0m [0m[1m[0mreplica_mode[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mreplicas[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mresource_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mskip_final_snapshot[0m[0m                   = false
      [32m+[0m [0m[1m[0msnapshot_identifier[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mstorage_type[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mtimezone[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0musername[0m[0m                              = (sensitive)
      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m                = [
          [32m+[0m [0m"sg-04c5a2138480b2548",
        ]
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[0m[1maws_db_instance.rds: Creating...[0m[0m
[0m[1maws_db_instance.rds: Still creating... [10s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [20s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [30s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [40s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [50s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [1m0s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [1m10s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [1m20s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [1m30s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [1m40s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [1m50s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [2m0s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [2m10s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [2m20s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [2m30s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [2m40s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [2m50s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [3m0s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [3m10s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [3m20s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [3m30s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [3m40s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [3m50s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [4m0s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [4m10s elapsed][0m[0m
[0m[1maws_db_instance.rds: Still creating... [4m20s elapsed][0m[0m
[0m[1maws_db_instance.rds: Creation complete after 4m28s [id=terraform-20220713164410976800000001][0m
[0m[1m[32m
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[0m